In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
import math
%matplotlib inline

In [2]:
df=pd.read_csv("Employee.csv")

In [4]:
df.head()

,EmployeeID,Name,Age,Gender,Department,Salary,Experience,City,JoiningYear,PerformanceRating
0,E001,Aarav,25.0,M,IT,45000.0,2.0,Mumbai,2022,4.0
1,E002,Neha,28.0,F,HR,38000.0,4.0,Pune,2020,3.0
2,E003,Rohan,35.0,M,Finance,62000.0,10.0,Bangalore,2015,5.0
3,E004,Priya,32.0,F,IT,NaN,8.0,Hyderabad,2017,4.0
4,E005,Kunal,29.0,M,Marketing,42000.0,5.0,Delhi,2019,3.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         30 non-null     object
 1   Name               30 non-null     object
 2   Age                29 non-null     float64
 3   Gender             30 non-null     object
 4   Department         30 non-null     object
 5   Salary             27 non-null     float64
 6   Experience         29 non-null     float64
 7   City               30 non-null     object
 8   JoiningYear        30 non-null     int64
 9   PerformanceRating  28 non-null     float64
dtypes: float64(4), int64(1), object(5)
memory usage: 2.5+ KB

In [18]:
df.nunique()

EmployeeID           27
Name                 27
Age                  18
Gender                2
Department            5
Salary               25
Experience           17
City                  6
JoiningYear          16
PerformanceRating     5
dtype: int64

In [6]:
df.duplicated().sum()

np.int64(3)

In [7]:
df.drop_duplicates(inplace=True)

In [8]:
df.duplicated().sum()

np.int64(0)

In [9]:
df.isnull().sum()

EmployeeID           0
Name                 0
Age                  1
Gender               0
Department           0
Salary               3
Experience           1
City                 0
JoiningYear          0
PerformanceRating    2
dtype: int64

In [10]:
avg_age=df.Age.mean()
avg_Salary=df.Salary.mean()
avg_Experience=df.Experience.mean()
avg_PerformanceRating=df.PerformanceRating.mean()

df.Age.replace(np.nan,avg_age, inplace = True)
df.Salary.replace(np.nan,avg_Salary, inplace = True)
df.Experience.replace(np.nan,avg_Experience, inplace = True)
df.PerformanceRating.replace(np.nan,avg_PerformanceRating, inplace = True)

In [12]:
df.head()

,EmployeeID,Name,Age,Gender,Department,Salary,Experience,City,JoiningYear,PerformanceRating
0,E001,Aarav,25.0,M,IT,45000.000000,2.0,Mumbai,2022,4.0
1,E002,Neha,28.0,F,HR,38000.000000,4.0,Pune,2020,3.0
2,E003,Rohan,35.0,M,Finance,62000.000000,10.0,Bangalore,2015,5.0
3,E004,Priya,32.0,F,IT,52791.666667,8.0,Hyderabad,2017,4.0
4,E005,Kunal,29.0,M,Marketing,42000.000000,5.0,Delhi,2019,3.0

In [14]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df[['Age','Salary']] = scaler.fit_transform(df[['Age','Salary']])
df.head()

,EmployeeID,Name,Age,Gender,Department,Salary,Experience,City,JoiningYear,PerformanceRating
0,E001,Aarav,0.047619,M,IT,0.224138,2.0,Mumbai,2022,4.0
1,E002,Neha,0.190476,F,HR,0.103448,4.0,Pune,2020,3.0
2,E003,Rohan,0.523810,M,Finance,0.517241,10.0,Bangalore,2015,5.0
3,E004,Priya,0.380952,F,IT,0.358477,8.0,Hyderabad,2017,4.0
4,E005,Kunal,0.238095,M,Marketing,0.172414,5.0,Delhi,2019,3.0

In [15]:
# Label Encoding
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df.PerformanceRating=encoder.fit_transform(df[['PerformanceRating']])
df.head()

,EmployeeID,Name,Age,Gender,Department,Salary,Experience,City,JoiningYear,PerformanceRating
0,E001,Aarav,0.047619,M,IT,0.224138,2.0,Mumbai,2022,3
1,E002,Neha,0.190476,F,HR,0.103448,4.0,Pune,2020,1
2,E003,Rohan,0.523810,M,Finance,0.517241,10.0,Bangalore,2015,4
3,E004,Priya,0.380952,F,IT,0.358477,8.0,Hyderabad,2017,3
4,E005,Kunal,0.238095,M,Marketing,0.172414,5.0,Delhi,2019,1

In [16]:
# Label Encoding
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df.Gender=encoder.fit_transform(df[['Gender']])
df.head()

,EmployeeID,Name,Age,Gender,Department,Salary,Experience,City,JoiningYear,PerformanceRating
0,E001,Aarav,0.047619,1,IT,0.224138,2.0,Mumbai,2022,3
1,E002,Neha,0.190476,0,HR,0.103448,4.0,Pune,2020,1
2,E003,Rohan,0.523810,1,Finance,0.517241,10.0,Bangalore,2015,4
3,E004,Priya,0.380952,0,IT,0.358477,8.0,Hyderabad,2017,3
4,E005,Kunal,0.238095,1,Marketing,0.172414,5.0,Delhi,2019,1

In [17]:
# Label Encoding
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df.Department=encoder.fit_transform(df[['Department']])
df.head()

,EmployeeID,Name,Age,Gender,Department,Salary,Experience,City,JoiningYear,PerformanceRating
0,E001,Aarav,0.047619,1,2,0.224138,2.0,Mumbai,2022,3
1,E002,Neha,0.190476,0,1,0.103448,4.0,Pune,2020,1
2,E003,Rohan,0.523810,1,0,0.517241,10.0,Bangalore,2015,4
3,E004,Priya,0.380952,0,2,0.358477,8.0,Hyderabad,2017,3
4,E005,Kunal,0.238095,1,3,0.172414,5.0,Delhi,2019,1